read_verilog verilog_examples/alu_bit_width/optimized.v
read_verilog verilog_examples/alu_bit_width/unoptimized.v
hierarchy
memory
proc
miter -equiv -make_assert optimized unoptimized miter
write_smt2 -tpl verilog_examples/combinatorial.tpl -stbv verilog_examples/alu_bit_width/alu_bit_width.generated.unsat.smt2
