read_verilog verilog_examples/basic/optimized.v
read_verilog verilog_examples/basic/unoptimized.v
hierarchy
memory
proc
miter -equiv -make_assert optimized unoptimized miter
write_smt2 -tpl verilog_examples/combinatorial.tpl -stbv verilog_examples/basic/basic.smt2
