read_verilog verilog_examples/basic/optimized.v
read_verilog verilog_examples/basic/unoptimized.v
hierarchy
memory
proc
miter -equiv optimized unoptimized miter
write_smt2 -stbv verilog_examples/basic/basic.smt2
